package ch1_자바.a1_java_자바;


/*
* 1. 운영체제에 독립적
* - JVM을 통하여 운영체제나 하드웨어에 접근하기 때문에 JVM에 종속적이다. 또한 해당 운영체제(OS) 마다
* JVM을 따로 제공하여 어디서나 동일하게 실행된다.
*
* 2. 객체지향언어
* - 모든 것을 객체화 시킬 수 있게 되면서 재사용성, 생산성 및 유지보수가 향상 되었다.
*
* 3. 간단한 구조
* - 여러 프로그래밍 언어에서 장점을 취하고 복잡하고 불필요한 부분을 제거하여 단순화 시켰다.
*
* 4. 자동 메모리 관리 (Garbege Collection)
* - 가비지 컬렉터가 자동적으로 메모리를 관리함으로써, 프로그래머가 따로 관리할 필요가 없다.
*
* 5. 멀티쓰레드 지원
* - 동시에 여러가지 작업을 수행할 수 있다.
*
* 6. 동적로딩(Dynamic Loading) 지원
* - 필요한 시점에 클래스를 사용할 수 있으며, 일부 클래스가 변경되어도 전체 어플리케이션을 다시 컴파일할 필요가 없다.
*
* */
public class 자바 {
}
